const tech_data = {
  id: 10001,
  count_number: 1,
  label: 'Технологии',
  content: [
    {
      year: 1980,
      description: 'Sinclair Rwesearch выпускает компьютер ZX80',
    },
    {
      year: 1982,
      description:
        'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
    },
    {
      year: 2017,
      description:
        'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
    },
    {
      year: 2018,
      description:
        'Старт космического аппарата Solar Probe Plus, предназначенного для изучения солнца',
    },
    {
      year: 2019,
      description:
        'Google объявил о создании 53-кубитного квантового компьютера',
    },
    {
      year: 2020,
      description:
        'Корабль Crew Dragon вернулся на землю из первого пилотируемого полёта',
    },
  ],
};

const cinema_data = {
  id: 20001,
  count_number: 2,
  label: 'Кино',
  content: [
    {
      year: 1987,
      description:
        '"Хищник"/Predator, США (реж. Джон Мактирнан)',
    },
    {
      year: 1988,
      description:
        '"Кто подставил Кролика Роджера"/Who Framed Roger Rabbit, США (реж. Роберт Земекис)',
    },
    {
      year: 1989,
      description:
        '"Назад в будущее 2"/Back to the future 2, США (реж. Роберт Земекис)',
    },
    {
      year: 1990,
      description:
        '"Крепкий орешек 2"/Die Hard 2, США (реж. Ренни Харлин)',
    },
    {
      year: 1991,
      description:
        '"Семейка Аддамс"/ The Addams Family, США (реж. Барри Зонненфельд>)',
    },
  ],
};

const literature_data = {
  id: 30001,
  count_number: 3,
  label: 'Литература',
  content: [
    {
      year: 1992,
      description:
        'Нобелевская премия по литературе - Дерек Уолкотт, "За блестящий образец карибского эпоса в 64 разделах"',
    },
    {
      year: 1994,
      description: '"Бесонница" - Роман Стивена Кинга.',
    },
    {
      year: 2000,
      description:
        'Нобелевская премия по литературе - Шеймсс Хини',
    },
    {
      year: 2001,
      description:
        'Нобелевская премия по литературе - Шеймсс Хини',
    },
    {
      year: 2050,
      description:
        'Нобелевская премия по литературе - Шеймсс Хини',
    },
  ],
};

const theater_data = {
  id: 40001,
  count_number: 4,
  label: 'Театр',
  content: [
    {
      year: 1999,
      description:
        'премьера балета «Золушка» постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона',
    },
    {
      year: 2000,
      description: 'возобновлено издание журнала "Театр".',
    },
    {
      year: 2002,
      description:
        'премьера трилогии Тома Стоппарда "Берег утопии", Королевский Национальный театр, Лондон',
    },
    {
      year: 2004,
      description:
        'премьера трилогии Тома Стоппарда "Берег утопии", Королевский Национальный театр, Лондон',
    },
    {
      year: 2005,
      description:
        'премьера трилогии Тома Стоппарда "Берег утопии", Королевский Национальный театр, Лондон',
    },
  ],
};

const sport_data = {
  id: 50001,
  count_number: 5,
  label: 'Спорт',
  content: [
    {
      year: 2006,
      description:
        'Баскетбольный клуб ЦСКА стал победителем национального первенства России',
    },
    {
      year: 2008,
      description:
        'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры',
    },
    {
      year: 2010,
      description:
        '13-28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года',
    },
    {
      year: 2012,
      description: '2 августа - Летние Олимпийские игры',
    },
    {
      year: 2014,
      description: 'XXII зимние Олимпийские игры (Сочи, Россия)',
    },
    {
      year: 2020,
      description:
        'Корабль Crew Dragon вернулся на землю из первого пилотируемого полёта',
    },
  ],
};

const science_data = {
  id: 60001,
  count_number: 6,
  label: 'Наука',
  content: [
    {
      year: 2015,
      description:
        '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
    },
    {
      year: 2016,
      description:
        'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
    },
    {
      year: 2017,
      description:
        'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
    },
    {
      year: 2018,
      description:
        'Старт космического аппарата Solar Probe Plus, предназначенного для изучения солнца',
    },
    {
      year: 2019,
      description:
        'Google объявил о создании 53-кубитного квантового компьютера',
    },
    {
      year: 2020,
      description:
        'Корабль Crew Dragon вернулся на землю из первого пилотируемого полёта',
    },
  ],
};

export const data_set = [
  tech_data,
  cinema_data,
  literature_data,
  theater_data,
  sport_data,
  science_data,
];
